STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE_Zigbee/BLE_Zigbee_Dyn/STM32_WPAN/App/app_zigbee.c
    zigbee_app_info.persistNumWrites++;
    APP_DBG("APP_ZIGBEE_persist_save: Persistence written (num writes = %d)", zigbee_app_info.persistNumWrites);
    return true;
}
#endif //WITH_PERSISTANT



/**
 * @brief  Trace the error or the warning reported.
 * @param  ErrId :
 * @param  ErrCode
 * @retval None
 */
void APP_ZIGBEE_Error(uint32_t ErrId, uint32_t ErrCode)
{
  switch (ErrId) {
  default:
    APP_ZIGBEE_TraceError("ERROR Unknown ", 0);
    break;
  }
} /* APP_ZIGBEE_Error */

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief  Warn the user that an error has occurred.In this case,
 *         the LEDs on the Board will start blinking.
 *
 * @param  pMess  : Message associated to the error.
 * @param  ErrCode: Error code associated to the module (Zigbee or other module if any)
 * @retval None
 */
static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode)
{
  APP_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);
  while (1U == 1U) {
    BSP_LED_Toggle(LED1);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED2);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED3);
    HAL_Delay(500U);
  }
} /* APP_ZIGBEE_TraceError */

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Zigbee
 *        and display associated information
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void)
{
  WirelessFwInfo_t wireless_info_instance;
  WirelessFwInfo_t *p_wireless_info = &wireless_info_instance;

  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success) {
    APP_ZIGBEE_Error((uint32_t)ERR_ZIGBEE_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else {
    APP_DBG("**********************************************************");
    APP_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    ZbStackType = p_wireless_info->StackType; /* Memorize ZB stack type */
    switch (p_wireless_info->StackType) {
    case INFO_STACK_TYPE_BLE_ZIGBEE_FFD_STATIC:
      APP_DBG("FW Type : STACK_TYPE_BLE_ZIGBEE_FFD_STATIC");
      break;
    case INFO_STACK_TYPE_BLE_ZIGBEE_FFD_DYNAMIC:
      APP_DBG("FW Type : STACK_TYPE_BLE_ZIGBEE_FFD_DYNAMIC");
      break;
    case INFO_STACK_TYPE_BLE_ZIGBEE_RFD_STATIC:
      APP_DBG("FW Type : STACK_TYPE_BLE_ZIGBEE_RFD_STATIC");
      break;
    case INFO_STACK_TYPE_BLE_ZIGBEE_RFD_DYNAMIC:
      APP_DBG("FW Type : STACK_TYPE_BLE_ZIGBEE_RFD_DYNAMIC");
      break;
    case INFO_STACK_TYPE_ZIGBEE_FFD:
      APP_DBG("FW Type : FFD Zigbee stack");
      break;
   case INFO_STACK_TYPE_ZIGBEE_RFD:
      APP_DBG("FW Type : RFD Zigbee stack");
      break;
    default:
      /* No Zigbee device supported ! */
      APP_ZIGBEE_Error((uint32_t)ERR_ZIGBEE_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
      break;
    }
    APP_DBG("**********************************************************");
  }
} /* APP_ZIGBEE_CheckWirelessFirmwareInfo */

static void APP_ZIGBEE_SW1_Process(void)
{
  struct ZbApsAddrT dst;

  memset(&dst, 0, sizeof(dst));
  dst.mode = ZB_APSDE_ADDRMODE_GROUP;
  dst.endpoint = SW1_ENDPOINT;
  dst.nwkAddr = SW1_GROUP_ADDR;

  APP_DBG("==> SENDING TOGGLE TO GROUP 0x0001");
  if (ZbZclOnOffClientToggleReq(zigbee_app_info.onoff_client_1, &dst, NULL, NULL) != ZCL_STATUS_SUCCESS) {
    APP_DBG("Error, ZbZclOnOffClientToggleReq failed (SW1_ENDPOINT)");
  }
}

static void APP_ZIGBEE_Process_OnOff_Toggle(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_TOGGLE_ON_OFF, CFG_SCH_PRIO_1);
}

static void APP_ZIGBEE_DbgNwkStatus(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_DBG_NWK_STATUS, CFG_SCH_PRIO_1);
}

static void APP_ZIGBEE_OnOff_Toggle(void)
{
  struct ZbApsAddrT dst;

  memset(&dst, 0, sizeof(dst));
  dst.mode = ZB_APSDE_ADDRMODE_SHORT;
  dst.endpoint = SW1_ENDPOINT;
  dst.nwkAddr = 0x0;
#ifdef  STRESS_TEST
  uint32_t time;
  
  if (toggle_cnt == 0) {
    time_start = HAL_GetTick();
  }
#endif

    if (ZbZclOnOffClientToggleReq(zigbee_app_info.onoff_client_1, &dst, toggle_cb, NULL) != ZCL_STATUS_SUCCESS)
    {
      APP_DBG("Error, ZbZclOnOffClientToggleReq failed (SW1_ENDPOINT)");
    }
#ifdef  STRESS_TEST
    printf("T");
    toggle_cnt++;
    if ((toggle_cnt % 10) == 0) printf("\n");
    UTIL_SEQ_WaitEvt(EVENT_ON_OFF_RSP);
    if ((toggle_cnt % 200) == 0) {
      time = HAL_GetTick() - time_start;
      APP_DBG_FULL(LOG_LEVEL_INFO, APPLI_LOG_REGION_GENERAL, "\n==> Nb TOGGLE ON/OFF sent: %d (%d Fail - %d%%) - %d BLE Disc - Toggle freq = %d ms %s",
          toggle_cnt, toggle_fail, (uint32_t)((toggle_fail * 100)/toggle_cnt), disc_cnt, (uint32_t)(time/toggle_cnt), COLOR_DEFAULT);
    }
#else
    toggle_cnt++;
    UTIL_SEQ_WaitEvt(EVENT_ON_OFF_RSP);
    APP_DBG_FULL(LOG_LEVEL_INFO, APPLI_LOG_REGION_GENERAL, "==> Nb TOGGLE ON/OFF sent: %d (%d Fail - %d%%) - %d BLE Disc %s",
        toggle_cnt, toggle_fail, (uint32_t)((toggle_fail * 100)/toggle_cnt), disc_cnt, COLOR_DEFAULT);
#endif  /* STRESS_TEST */
    /* Next toggle after TOGGLE_INTERVAL */
    HW_TS_Start(Timer_ToggleOnOff_Id, (uint32_t)TOGGLE_INTERVAL);
}


static void toggle_cb(struct ZbZclCommandRspT *rsp, void *arg)
{
  if(rsp->status != ZCL_STATUS_SUCCESS)
  {
#ifndef  STRESS_TEST
    APP_DBG("TOGGLE RSP FAIL status %d",rsp->status);
#else
    printf("-");
#endif
    toggle_fail++;
  }
  else
  {
#ifndef  STRESS_TEST
    APP_DBG("TOGGLE RSP SUCCESS from %#08llx",rsp->src.extAddr);
#else
    printf("+");
#endif
  }
  UTIL_SEQ_SetEvt(EVENT_ON_OFF_RSP);
}

#ifdef TRACE_ZB_FULL_NNT
const char *
ZbNwk_NeighborRelationshipToStr(enum ZbNwkNeighborRelT relationship)
{
    const char *str;

    switch (relationship) {
        case ZB_NWK_NEIGHBOR_REL_PARENT:
            str = "Parent";
            break;

        case ZB_NWK_NEIGHBOR_REL_CHILD:
            str = "Child";
            break;

        case ZB_NWK_NEIGHBOR_REL_SIBLING:
            str = "Sibling";
            break;

        case ZB_NWK_NEIGHBOR_REL_NONE:
            str = "None";
            break;

