STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE_Zigbee/BLE_Zigbee_Dyn/STM32_WPAN/App/app_zigbee.c
        case ZB_NWK_NEIGHBOR_REL_PREV_CHILD:
            str = "Prev Child";
            break;

        case ZB_NWK_NEIGHBOR_REL_UNAUTH_CHILD:
            str = "Unauth Child";
            break;

        case ZB_NWK_NEIGHBOR_REL_PEND_ASSOCIATE:
        case ZB_NWK_NEIGHBOR_REL_PEND_ORPHAN:
            str = "Pend Child";
            break;

        default:
            str = "Reserved";
            break;
    } /* switch */
    return (str);
}

const char *
ZbNwk_NeighborDeviceTypeToStr(enum ZbNwkNeighborTypeT deviceType)
{
    const char *str;
    switch (deviceType) {
        case ZB_NWK_NEIGHBOR_TYPE_COORD:
            str = "Crd";
            break;

        case ZB_NWK_NEIGHBOR_TYPE_ROUTER:
            str = "Rtr";
            break;

        case ZB_NWK_NEIGHBOR_TYPE_END_DEV:
            str = "End";
            break;

        case ZB_NWK_NEIGHBOR_TYPE_UNKNOWN:
        default:
            str = "Unk";
            break;
    } /* switch */
    return (str);
}
#endif  /* ifdef TRACE_ZB_FULL_NNT */

static void APP_ZIGBEE_Status_Nnt(void)
{
    struct ZbNwkNeighborT neighbor;
    uint64_t epid;
    unsigned int i;
#ifdef TRACE_ZB_FULL_NNT
    unsigned int tempLen;
    unsigned int nnt_index = 0;
    char temp[256];
#endif

    epid = 0;
    ZbNwkGet(zigbee_app_info.zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(uint64_t));

#ifdef TRACE_ZB_FULL_NNT
    APP_DBG("-- ZigBee Network Neighbor Table ----------------------------------------------");
    tempLen = 0;
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "    %-23s", "EXTADDR");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %-7s", "NWKADDR");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %-4s", "TYPE");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %-6s", "RXIDLE");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %-12s", "RELATION");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %6s", "TXFAIL");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %4s", "AGE");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %4s", "LQI");
    tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %4s", "COST");
    APP_DBG("%s", temp);
#endif

    for (i = 0;; i++) {
        if (epid == 0) {
            /* The NNT doesn't make much sense if we haven't joined/formed a network.
             * Skip it and use the discovery table instead. */
            break;
        }
        if (ZbNwkGetIndex(zigbee_app_info.zb, ZB_NWK_NIB_ID_NeighborTable, &neighbor, sizeof(neighbor), i) != ZB_NWK_STATUS_SUCCESS) {
            break;
        }
        /* Skip unused entries. */
        if (neighbor.nwkAddr == ZB_NWK_ADDR_UNDEFINED) {
            continue;
        }
#ifdef TRACE_ZB_FULL_NNT
        nnt_index++;

        tempLen = 0;
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "%3d ", nnt_index);

        /* EXTADDR */
        if (neighbor.extAddr) {
            tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "0x%016" PRIx64 "     ", neighbor.extAddr);
        }
        else {
            tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "%-23s", " ");
        }
        /* NWKADDR */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  0x%04x ", neighbor.nwkAddr);
        /* TYPE */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %-4s", ZbNwk_NeighborDeviceTypeToStr(neighbor.deviceType));
        /* RXIDLE */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %-6s", neighbor.rxOnWhenIdle ? "True" : "False");
        /* RELATION */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %-12s", ZbNwk_NeighborRelationshipToStr(neighbor.relationship));
        /* TXFAIL */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %6d", neighbor.txFailure);
        /* AGE */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %4d", neighbor.age);
        /* LQI */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %4d", neighbor.lqi);
        /* COST */
        tempLen += snprintf(&temp[tempLen], OUTPUT_LINE_MAX_LEN - tempLen, "  %4d", neighbor.outgoingCost);

        APP_DBG("%s", temp);
#endif

        if (neighbor.age == 4) { /* If AGE 4, force update BLE connection interval */
          APP_BLE_Key_Button2_Action(); /* update BLE connection interval */
        }
   } /* for */

}


/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

void APP_ZIGBEE_RegisterCmdBuffer(TL_CmdPacket_t *p_buffer)
{
  p_ZIGBEE_otcmdbuffer = p_buffer;
} /* APP_ZIGBEE_RegisterCmdBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_OTCmdPayloadBuffer(void)
{
  return (Zigbee_Cmd_Request_t *)p_ZIGBEE_otcmdbuffer->cmdserial.cmd.payload;
} /* ZIGBEE_Get_OTCmdPayloadBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_OTCmdRspPayloadBuffer(void)
{
  return (Zigbee_Cmd_Request_t *)((TL_EvtPacket_t *)p_ZIGBEE_otcmdbuffer)->evtserial.evt.payload;
} /* ZIGBEE_Get_OTCmdRspPayloadBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_NotificationPayloadBuffer(void)
{
  return (Zigbee_Cmd_Request_t *)(p_ZIGBEE_notif_M0_to_M4)->evtserial.evt.payload;
} /* ZIGBEE_Get_NotificationPayloadBuffer */

Zigbee_Cmd_Request_t * ZIGBEE_Get_M0RequestPayloadBuffer(void)
{
  return (Zigbee_Cmd_Request_t *)(p_ZIGBEE_request_M0_to_M4)->evtserial.evt.payload;
}

/**
 * @brief  This function is used to transfer the commands from the M4 to the M0.
 *
 * @param   None
 * @return  None
 */
void ZIGBEE_CmdTransfer(void)
{
  Zigbee_Cmd_Request_t *cmd_req = (Zigbee_Cmd_Request_t *)p_ZIGBEE_otcmdbuffer->cmdserial.cmd.payload;

  /* Zigbee OT command cmdcode range 0x280 .. 0x3DF = 352 */
  p_ZIGBEE_otcmdbuffer->cmdserial.cmd.cmdcode = 0x280U;
  /* Size = otCmdBuffer->Size (Number of OT cmd arguments : 1 arg = 32bits so multiply by 4 to get size in bytes)
   * + ID (4 bytes) + Size (4 bytes) */
  p_ZIGBEE_otcmdbuffer->cmdserial.cmd.plen = 8U + (cmd_req->Size * 4U);

  TL_ZIGBEE_SendM4RequestToM0();

